{"items":[{"title":"What is a Next Action?","id":"tag:world.hey.com,2005:World::Post/11917","url":"https://world.hey.com/blp/what-is-a-next-action-9b0e0ef1","link":"https://world.hey.com/blp/what-is-a-next-action-9b0e0ef1","author":"Brandon Pittman","published":1623718746963,"created":1621995360000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>Is it something you can do now? Something unblocked?<br><br>Or is it something you intend to do. Like, <em>I'm doing this, this week</em>.<br><br>If a next action is something you have intention behind, does that mean everything else automatically becomes a Someday/Maybe action? Everything starts as <em>Someday</em>, and once you have put intention into it (for the upcoming week, for example), it becomes a <em>Next Action</em>?<br><br>Then each day you look at your restrained list of action you have the intention of doing, and choose your <em>Today</em> tasks?<br><br>Seems manageable. Intentioned. Calm.<br><br>Will requiring a change of mindset—that everything starts as a <em>Someday</em> task. Or at least, you only put tasks you intend to do in the next week onto your <em>Next</em> list.</div>\\n</div>","enclosures":[]},{"title":"The Nightcap","id":"tag:world.hey.com,2005:World::Post/11872","url":"https://world.hey.com/blp/the-nightcap-cf83aa8e","link":"https://world.hey.com/blp/the-nightcap-cf83aa8e","author":"Brandon Pittman","published":1623718746963,"created":1621937840000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>The other day, I was reading <a href=\\"https://world.hey.com/dhh/not-just-what-you-read-but-how-64648303\\">DHH's post about how he reads</a>, and while I also used <a href=\\"https://mailbrew.com/?aff=blp\\">Mailbrew</a> to throttle Twitter (before I ditched Twitter entirely) and to create a daily digest of RSS feeds, I loved his idea to have an evening email that packaged up YouTube channels and included their new videos. It's essentially the same as subscribing to them, but there's nothing in my actual subscription tab now, and there's a friction to adding them to Mailbrew that wasn't there when just subscribing inside of YouTube. <strong>It prevents me from just subscribing to everything.<br><br></strong>I call the brew <em>The Nightcap</em>. It's delivered daily at 7pm and it's just all the YouTube stuff I might watch. You don't even need a YouTube account to take advantage of Mailbrew's YouTube integration the way you need a Twitter account to work with Twitter in Mailbrew. <strong><br></strong><br></div>\\n</div>","enclosures":[]},{"title":"Safari Could Eat Chrome's Lunch","id":"tag:world.hey.com,2005:World::Post/11494","url":"https://world.hey.com/blp/safari-could-eat-chrome-s-lunch-f5b8b005","link":"https://world.hey.com/blp/safari-could-eat-chrome-s-lunch-f5b8b005","author":"Brandon Pittman","published":1623718746963,"created":1621472709000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>…if only it had better devtools.<br><br>Mac people don't want to use Chrome. Most Mac users I know will stick to Safari. The only times I see people jumping over to Chrome are web devs because Safari's dev tools aren't as good as Chrome's. If Safari had dev tools on par with Chrome's (and WebKit had parity with Chrome's JavaScript and CSS support), Safari would be the only browser web devs ever needed.</div>\\n</div>","enclosures":[]},{"title":"Escaping Twitter","id":"tag:world.hey.com,2005:World::Post/11065","url":"https://world.hey.com/blp/escaping-twitter-3f7cca8a","link":"https://world.hey.com/blp/escaping-twitter-3f7cca8a","author":"Brandon Pittman","published":1623718746963,"created":1620696527000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>I deleted my Twitter account recently. I didn't say I was doing it before I deleted it and I wasn't going to say anything about it—just be gone.</div><div><br></div><div>I deleted my account because I wanted to ensure I didn't wind up falling into <em>Twitter Traps</em> (rabbit holes filled with angry people arguing over nonsense that has no effect on them but fills them with rage anyway). But if you follow tech/programming news, it's impossible to avoid Twitter entirely—because so much of the news in this bubble is generated on Twitter.</div><div><br></div><div>I was checking the <a href=\\"https://pinboard.in/popular\\">&quot;Popular&quot; list on Pinboard</a> and saw a post about <a href=\\"https://tailwindcss.com/\\">Tailwind CSS</a>, a CSS framework that I love and use daily. The title of the post was <a href=\\"https://dev.to/brianboyko/tailwindcss-adds-complexity-does-nothing-3hpn\\">TailwindCSS: Adds complexity, does nothing</a>. I should have known what the content of the post would be because I've seen the same sorts of complaints lodged over the last couple of years. But I followed the trail and read the post. It was what I expected—it wasn't going to change my mind. I followed a link at the bottom to a rebuttal but it wasn't a well-written one. Then a link promoted at the bottom of that post led me to <a href=\\"https://dev.to/cher/sexism-racism-toxic-positivity-and-tailwindcss-cil\\">a post pointing out that Adam Wathan left a passive-aggressive reply</a> to a Sara Soueidan tweet that linked to the original anti-Tailwind post.</div><div><br></div><div><strong>You can't avoid Twitter traps even if you don't have a Twitter account.</strong></div><div><br></div><div>The third post supposed that Adam's response was a sexist and/or quasi-white supremacist response to him getting his feelings hurt by a woman of color. Maybe, but what struck me most was that he didn't need to say anything. He's making so much money from Tailwind UI and Refactoring UI that he can employ multiple people. He doesn't need to leave back-handed comments to anyone (especially someone who does so much to help people with things like SVG mastery and accessibility—both areas that are woefully under-covered in web dev education).</div><div><br></div><div>I immediately thought of a quote from <em>Meditations</em> where Marcus Aurelius reminds himself that &quot;you don't have to have an opinion about this.&quot; I see how Adam wants everyone to just be positive—it suits his purpose. <a href=\\"https://adamwathan.me/css-utility-classes-and-separation-of-concerns/\\">But he shits on non-Tailwind ways of handling CSS as well</a>. He's not the ray of sunshine he wants others to be. Sara's post is constructive either. Adam has a point about <a href=\\"https://avc.com/2021/03/staying-positive/\\">being positive</a>. But neither of them needed to have an opinion. Arguably, Adam's response was far worse though, because he went out of his way to take personal offense to someone's critique of a thing he made and then tried to hurt another person personally and directly.</div><div><br></div><div>Lesson learned: we can't avoid Twitter drama unless we stop reading programming news entirely and people with egos need to feel validated at all times and if they don't they will lash out.</div>\\n</div>","enclosures":[]},{"title":"On Team Communication","id":"tag:world.hey.com,2005:World::Post/10416","url":"https://world.hey.com/blp/on-team-communication-810d4d60","link":"https://world.hey.com/blp/on-team-communication-810d4d60","author":"Brandon Pittman","published":1623718746963,"created":1619570049000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>Just because you work in the same department doesn’t mean you’re a <em>team</em>. <em>Teams</em> work together towards a common goal. If your backend, frontend, and design teams are all moving independently of one another, how can they ever be able to move as one and deliver a feature on schedule? <br><br>The key to solving this problem isn't more chat. The solution is to set clear boundaries for what the feature is going to be and what it isn't going to be. By setting boundaries at the start, your people can be free to flex their creativity while knowing what they must include and what rabbit holes they should avoid. It creates a starting point for everyone to start working at the outset, and then the designer can follow up with programmers about what specifics (i.e. affordances) the design needs. </div>\\n</div>","enclosures":[]},{"title":"Trust Is a Battery","id":"tag:world.hey.com,2005:World::Post/10340","url":"https://world.hey.com/blp/trust-is-a-battery-6b599915","link":"https://world.hey.com/blp/trust-is-a-battery-6b599915","author":"Brandon Pittman","published":1623718746963,"created":1619510018000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <blockquote>The reality is that the trust battery is a summary of all interactions to date. If you want to recharge the battery, you have to do different things in the future. Only new actions and new attitudes count.<br>— It Doesn't Have to Be Crazy at Work</blockquote><div><br>You can't expect people to trust you right off the bat and you can't expect them to trust you after you've abused it in the past. This goes in both directions—from above and from below. If your boss takes advantage of you, you won't want to help them out and if you do the same to them, they won't be so keen on giving you any slack.<br><br>So be good to each other, keep your promises, and make sure the battery stays topped up.</div><div><br><br></div>\\n</div>","enclosures":[]},{"title":"The Joy of Missing Out","id":"tag:world.hey.com,2005:World::Post/10270","url":"https://world.hey.com/blp/the-joy-of-missing-out-511851f4","link":"https://world.hey.com/blp/the-joy-of-missing-out-511851f4","author":"Brandon Pittman","published":1623718746963,"created":1619444637000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>It's fine not to know everything. This applies to intellectuals pursuits and to social ones as well. You can quit all social media (or at least ignore it for the most part) <strong>and nothing bad will happen to you</strong>.<br><br>You'll probably be happier for it.<br><br>My boss pulled up Facebook today and my response was, &quot;Is that what Facebook looks like? I haven't looked at it in years.&quot; He said that was a cool thing to say. I'm not saying this to make myself look cool, I'm saying this because it's obvious that people want to get away from social media <strong>but they feel like they can't</strong>. <br><br>So let yourself miss out. It's fine. You won't die. You'll have more of your time back. You'll be happier.</div>\\n</div>","enclosures":[]},{"title":"Your New Status Message","id":"tag:world.hey.com,2005:World::Post/10244","url":"https://world.hey.com/blp/your-new-status-message-35ebb97b","link":"https://world.hey.com/blp/your-new-status-message-35ebb97b","author":"Brandon Pittman","published":1623718746963,"created":1619413182000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <blockquote>I’m trying to do my job, please respect my time and attention.</blockquote><div><br>Let's start beating the <em>leave me the fuck alone, I'm working</em> drum. The constant flood of Slack messages, shoulder taps, and status meetings does not improve efficacy or output volume. Quite the opposite, in fact. So let's all set our Slack status to <em>I’m trying to do my job, please respect my time and attention</em>.<br><br>Most won't even read it, but let's try to get the movement going.</div>\\n</div>","enclosures":[]},{"title":"Forget Your Goals","id":"tag:world.hey.com,2005:World::Post/10105","url":"https://world.hey.com/blp/forget-your-goals-113eaa77","link":"https://world.hey.com/blp/forget-your-goals-113eaa77","author":"Brandon Pittman","published":1623718746963,"created":1619225692000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <blockquote>Set out to do good work. Set out to be fair in your dealings with customers, employees, and reality. Leave a lasting impression with the people you touch and worry less (or not at all!) about changing the world. Chances are, you won’t, and if you do, it’s not going to be because you said you would.<br>— It Doesn’t Have to be Crazy at Work</blockquote><div><br>Don’t set out to get to a certain sales figure. That’s ultimately out of your control. Do what you can to make the best thing you can, knowing that you did your best work. </div>\\n</div>","enclosures":[]},{"title":"Unintentional Stoicism","id":"tag:world.hey.com,2005:World::Post/10056","url":"https://world.hey.com/blp/unintentional-stoicism-b25b77b7","link":"https://world.hey.com/blp/unintentional-stoicism-b25b77b7","author":"Brandon Pittman","published":1623718746963,"created":1619186228000,"category":[],"content":"<div class=\\"trix-content\\">\\n  <div>The more time I spend getting to know Basecamp and its processes, the more Stoicism I see in the company. They value calm over big moves. They focus on the current moment and what can be done <em>now</em>. They care about treating people justly. <br><br>Stoicism doesn’t just have to apply to your personal life. It applies to your business as well. See your competitors for who they are—other people just trying to get by. Don’t treat them with contempt. Treat your employees with compassion. Trust them to do the job you hired them for. And be moderate in the choices you make. Don’t build the Taj Mahal when a shed will suffice. Do the thing that’ll get the job done adequately <em>now</em>. </div>\\n</div>","enclosures":[]}],"title":"Brandon Pittman","link":[{"rel":"alternate","type":"text/html","href":"https://world.hey.com/blp"},{"rel":"self","type":"application/atom+xml","href":"https://world.hey.com/blp/feed.atom"}],"category":[]}
